tap "danvergara/tools"
tap "daveshanley/vacuum"
tap "superatomic/bundle-extensions"
tap "go-task/tap"
tap "gowebly/tap"
tap "hashicorp/tap"
tap "helmwave/tap"
tap "homebrew/bundle"
tap "int128/kubelogin"
tap "intelligence-ai/apps"
brew "autoenv"
brew "bash"
brew "bat"
brew "python@3.12"
brew "chezmoi"
brew "commitizen"
brew "d2"
brew "docker"
brew "docker-buildx"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "git-town"
brew "go"
brew "golangci-lint"
brew "gomplate"
brew "gotestsum"
brew "graphviz"
brew "helm"
brew "hey"
brew "hugo"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "libpq", link: true
brew "minikube"
brew "neovim"
brew "node"
brew "nushell"
brew "ollama"
brew "p7zip"
brew "pgcli"
brew "pipx"
brew "pnpm"
brew "poetry"
brew "ripgrep"
brew "rust"
brew "sqlc"
brew "starship"
brew "telnet"
brew "tree"
brew "typescript"
brew "zoxide"
brew "zsh"
brew "danvergara/tools/dblab"
brew "daveshanley/vacuum/vacuum"
brew "go-task/tap/go-task"
brew "helmwave/tap/helmwave"
brew "int128/kubelogin/kubelogin"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-monaspace"
vscode "42crunch.vscode-openapi"
vscode "adpyke.vscode-sql-formatter"
vscode "alefragnani.project-manager"
vscode "bradlc.vscode-tailwindcss"
vscode "bradymholt.pgformatter"
vscode "bruno-api-client.bruno"
vscode "casualjim.gotemplate"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fabianlauer.vs-code-xml-format"
vscode "golang.go"
vscode "irongeek.vscode-env"
vscode "mechatroner.rainbow-csv"
vscode "mike-co.import-sorter"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "quasilyte.perf-heatmap"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "redocly.openapi-vs-code"
vscode "steoates.autoimport"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "terrastruct.d2"
vscode "tim-koehler.helm-intellisense"
vscode "tonwhales.func-vscode"
vscode "vintharas.learn-vim"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "yzhang.markdown-all-in-one"
cask "1password-cli"
